GopalSaraf/Practicals/PSDL/include/proc/pic18f24k42.inc
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7, b
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0, b
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1, b
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7, b
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0, b
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1, b
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2, b
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3, b
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4, b
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5, b
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6, b
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7, b
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0, b
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1, b
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2, b
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3, b
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2, b
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4, b
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5, b
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6, b
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7, b
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3, b
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4, b
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5, b
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6, b
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7, b
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0, b
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1, b
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6, b
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0, b
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1, b
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2, b
#define SMT1EN                           BANKMASK(SMT1CON0), 7, b
#define SMT1GO                           BANKMASK(SMT1CON1), 7, b
#define SMT1IE                           BANKMASK(PIE1), 5, b
#define SMT1IF                           BANKMASK(PIR1), 5, b
#define SMT1IP                           BANKMASK(IPR1), 5, b
#define SMT1MD                           BANKMASK(PMD6), 5, b
#define SMT1PR0                          BANKMASK(SMT1PRL), 0, b
#define SMT1PR1                          BANKMASK(SMT1PRL), 1, b
#define SMT1PR10                         BANKMASK(SMT1PRH), 2, b
#define SMT1PR11                         BANKMASK(SMT1PRH), 3, b
#define SMT1PR12                         BANKMASK(SMT1PRH), 4, b
#define SMT1PR13                         BANKMASK(SMT1PRH), 5, b
#define SMT1PR14                         BANKMASK(SMT1PRH), 6, b
#define SMT1PR15                         BANKMASK(SMT1PRH), 7, b
#define SMT1PR16                         BANKMASK(SMT1PRU), 0, b
#define SMT1PR17                         BANKMASK(SMT1PRU), 1, b
#define SMT1PR18                         BANKMASK(SMT1PRU), 2, b
#define SMT1PR19                         BANKMASK(SMT1PRU), 3, b
#define SMT1PR2                          BANKMASK(SMT1PRL), 2, b
#define SMT1PR20                         BANKMASK(SMT1PRU), 4, b
#define SMT1PR21                         BANKMASK(SMT1PRU), 5, b
#define SMT1PR22                         BANKMASK(SMT1PRU), 6, b
#define SMT1PR23                         BANKMASK(SMT1PRU), 7, b
#define SMT1PR3                          BANKMASK(SMT1PRL), 3, b
#define SMT1PR4                          BANKMASK(SMT1PRL), 4, b
#define SMT1PR5                          BANKMASK(SMT1PRL), 5, b
#define SMT1PR6                          BANKMASK(SMT1PRL), 6, b
#define SMT1PR7                          BANKMASK(SMT1PRL), 7, b
#define SMT1PR8                          BANKMASK(SMT1PRH), 0, b
#define SMT1PR9                          BANKMASK(SMT1PRH), 1, b
#define SMT1PRAIE                        BANKMASK(PIE1), 6, b
#define SMT1PRAIF                        BANKMASK(PIR1), 6, b
#define SMT1PRAIP                        BANKMASK(IPR1), 6, b
#define SMT1PS0                          BANKMASK(SMT1CON0), 0, b
#define SMT1PS1                          BANKMASK(SMT1CON0), 1, b
#define SMT1PWAIE                        BANKMASK(PIE1), 7, b
#define SMT1PWAIF                        BANKMASK(PIR1), 7, b
#define SMT1PWAIP                        BANKMASK(IPR1), 7, b
#define SMT1REPEAT                       BANKMASK(SMT1CON1), 6, b
#define SMT1RESET                        BANKMASK(SMT1STAT), 5, b
#define SMT1RST                          BANKMASK(SMT1STAT), 5, b
#define SMT1SPOL                         BANKMASK(SMT1CON0), 3, b
#define SMT1SSEL0                        BANKMASK(SMT1SIG), 0, b
#define SMT1SSEL1                        BANKMASK(SMT1SIG), 1, b
#define SMT1SSEL2                        BANKMASK(SMT1SIG), 2, b
#define SMT1SSEL3                        BANKMASK(SMT1SIG), 3, b
#define SMT1SSEL4                        BANKMASK(SMT1SIG), 4, b
#define SMT1STP                          BANKMASK(SMT1CON0), 5, b
#define SMT1TMR0                         BANKMASK(SMT1TMRL), 0, b
#define SMT1TMR1                         BANKMASK(SMT1TMRL), 1, b
#define SMT1TMR10                        BANKMASK(SMT1TMRH), 2, b
#define SMT1TMR11                        BANKMASK(SMT1TMRH), 3, b
#define SMT1TMR12                        BANKMASK(SMT1TMRH), 4, b
#define SMT1TMR13                        BANKMASK(SMT1TMRH), 5, b
#define SMT1TMR14                        BANKMASK(SMT1TMRH), 6, b
#define SMT1TMR15                        BANKMASK(SMT1TMRH), 7, b
#define SMT1TMR16                        BANKMASK(SMT1TMRU), 0, b
#define SMT1TMR17                        BANKMASK(SMT1TMRU), 1, b
#define SMT1TMR18                        BANKMASK(SMT1TMRU), 2, b
#define SMT1TMR19                        BANKMASK(SMT1TMRU), 3, b
#define SMT1TMR2                         BANKMASK(SMT1TMRL), 2, b
#define SMT1TMR20                        BANKMASK(SMT1TMRU), 4, b
#define SMT1TMR21                        BANKMASK(SMT1TMRU), 5, b
#define SMT1TMR22                        BANKMASK(SMT1TMRU), 6, b
#define SMT1TMR23                        BANKMASK(SMT1TMRU), 7, b
#define SMT1TMR3                         BANKMASK(SMT1TMRL), 3, b
#define SMT1TMR4                         BANKMASK(SMT1TMRL), 4, b
#define SMT1TMR5                         BANKMASK(SMT1TMRL), 5, b
#define SMT1TMR6                         BANKMASK(SMT1TMRL), 6, b
#define SMT1TMR7                         BANKMASK(SMT1TMRL), 7, b
#define SMT1TMR8                         BANKMASK(SMT1TMRH), 0, b
#define SMT1TMR9                         BANKMASK(SMT1TMRH), 1, b
#define SMT1TS                           BANKMASK(SMT1STAT), 2, b
#define SMT1WOL                          BANKMASK(SMT1CON0), 4, b
#define SMT1WS                           BANKMASK(SMT1STAT), 1, b
#define SMT1WSEL0                        BANKMASK(SMT1WIN), 0, b
#define SMT1WSEL1                        BANKMASK(SMT1WIN), 1, b
#define SMT1WSEL2                        BANKMASK(SMT1WIN), 2, b
#define SMT1WSEL3                        BANKMASK(SMT1WIN), 3, b
#define SMT1WSEL4                        BANKMASK(SMT1WIN), 4, b
#define SOI                              BANKMASK(ADCON3), 3, b
#define SOR                              BANKMASK(OSCSTAT), 3, b
#define SOSCEN                           BANKMASK(OSCEN), 3, b
#define SOSCPWR                          BANKMASK(OSCCON3), 6, b
#define SOSIE                            BANKMASK(SPI1INTE), 5, b
#define SOSIF                            BANKMASK(SPI1INTF), 5, b
#define SP0                              BANKMASK(STKPTR), 0, a
#define SP1                              BANKMASK(STKPTR), 1, a
#define SP2                              BANKMASK(STKPTR), 2, a
#define SP3                              BANKMASK(STKPTR), 3, a
#define SP4                              BANKMASK(STKPTR), 4, a
#define SPI1BMODE                        BANKMASK(SPI1CON0), 0, b
#define SPI1BUSY                         BANKMASK(SPI1CON2), 7, b
#define SPI1CKE                          BANKMASK(SPI1CON1), 6, b
#define SPI1CKP                          BANKMASK(SPI1CON1), 5, b
#define SPI1CLKSEL0                      BANKMASK(SPI1CLK), 0, b
#define SPI1CLKSEL1                      BANKMASK(SPI1CLK), 1, b
#define SPI1CLKSEL2                      BANKMASK(SPI1CLK), 2, b
#define SPI1CLKSEL3                      BANKMASK(SPI1CLK), 3, b
#define SPI1CLRBF                        BANKMASK(SPI1STATUS), 2, b
#define SPI1EOSIE                        BANKMASK(SPI1INTE), 4, b
#define SPI1EOSIF                        BANKMASK(SPI1INTF), 4, b
#define SPI1FST                          BANKMASK(SPI1CON1), 4, b
#define SPI1IE                           BANKMASK(PIE2), 6, b
#define SPI1IF                           BANKMASK(PIR2), 6, b
#define SPI1IP                           BANKMASK(IPR2), 6, b
#define SPI1LSBF                         BANKMASK(SPI1CON0), 2, b
#define SPI1MD                           BANKMASK(PMD5), 2, b
#define SPI1MST                          BANKMASK(SPI1CON0), 1, b
#define SPI1RXBF                         BANKMASK(SPI1STATUS), 0, b
#define SPI1RXIE                         BANKMASK(PIE2), 4, b
#define SPI1RXIF                         BANKMASK(PIR2), 4, b
#define SPI1RXIP                         BANKMASK(IPR2), 4, b
#define SPI1RXOIE                        BANKMASK(SPI1INTE), 2, b
#define SPI1RXOIF                        BANKMASK(SPI1INTF), 2, b
#define SPI1RXR                          BANKMASK(SPI1CON2), 0, b
#define SPI1RXRE                         BANKMASK(SPI1STATUS), 3, b
#define SPI1SDIP                         BANKMASK(SPI1CON1), 1, b
#define SPI1SDOP                         BANKMASK(SPI1CON1), 0, b
#define SPI1SMP                          BANKMASK(SPI1CON1), 7, b
#define SPI1SOSIE                        BANKMASK(SPI1INTE), 5, b
#define SPI1SOSIF                        BANKMASK(SPI1INTF), 5, b
#define SPI1SPIEN                        BANKMASK(SPI1CON0), 7, b
#define SPI1SRMTIE                       BANKMASK(SPI1INTE), 7, b
#define SPI1SRMTIF                       BANKMASK(SPI1INTF), 7, b
#define SPI1SSET                         BANKMASK(SPI1CON2), 2, b
#define SPI1SSFLT                        BANKMASK(SPI1CON2), 6, b
#define SPI1SSP                          BANKMASK(SPI1CON1), 2, b
#define SPI1TCZIE                        BANKMASK(SPI1INTE), 6, b
#define SPI1TCZIF                        BANKMASK(SPI1INTF), 6, b
#define SPI1TXBE                         BANKMASK(SPI1STATUS), 5, b
#define SPI1TXIE                         BANKMASK(PIE2), 5, b
#define SPI1TXIF                         BANKMASK(PIR2), 5, b
#define SPI1TXIP                         BANKMASK(IPR2), 5, b
#define SPI1TXR                          BANKMASK(SPI1CON2), 1, b
#define SPI1TXUIE                        BANKMASK(SPI1INTE), 1, b
#define SPI1TXUIF                        BANKMASK(SPI1INTF), 1, b
#define SPI1TXWE                         BANKMASK(SPI1STATUS), 7, b
#define SPOL                             BANKMASK(SMT1CON0), 3, b
#define SRMTIE                           BANKMASK(SPI1INTE), 7, b
#define SRMTIF                           BANKMASK(SPI1INTF), 7, b
#define SSEL0                            BANKMASK(SMT1SIG), 0, b
#define SSEL1                            BANKMASK(SMT1SIG), 1, b
#define SSEL2                            BANKMASK(SMT1SIG), 2, b
#define SSEL3                            BANKMASK(SMT1SIG), 3, b
#define SSEL4                            BANKMASK(SMT1SIG), 4, b
#define SSET                             BANKMASK(SPI1CON2), 2, b
#define SSFLT                            BANKMASK(SPI1CON2), 6, b
#define SSP                              BANKMASK(SPI1CON1), 2, b
#define STAT2                            BANKMASK(ADSTAT), 2, b
#define STATE                            BANKMASK(WDTTMR), 2, b
#define STKOVF                           BANKMASK(PCON0), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(PCON0), 6, a
#define STP                              BANKMASK(SMT1CON0), 5, b
#define STPT0                            BANKMASK(ADSTPTL), 0, b
#define STPT1                            BANKMASK(ADSTPTL), 1, b
#define STPT10                           BANKMASK(ADSTPTH), 2, b
#define STPT11                           BANKMASK(ADSTPTH), 3, b
#define STPT12                           BANKMASK(ADSTPTH), 4, b
#define STPT13                           BANKMASK(ADSTPTH), 5, b
#define STPT15                           BANKMASK(ADSTPTH), 6, b
#define STPT16                           BANKMASK(ADSTPTH), 7, b
#define STPT2                            BANKMASK(ADSTPTL), 2, b
#define STPT3                            BANKMASK(ADSTPTL), 3, b
#define STPT4                            BANKMASK(ADSTPTL), 4, b
#define STPT5                            BANKMASK(ADSTPTL), 5, b
#define STPT6                            BANKMASK(ADSTPTL), 6, b
#define STPT7                            BANKMASK(ADSTPTL), 7, b
#define STPT8                            BANKMASK(ADSTPTH), 0, b
#define STPT9                            BANKMASK(ADSTPTH), 1, b
#define SWDTEN                           BANKMASK(WDTCON0), 0, b
#define SWIE                             BANKMASK(PIE0), 0, b
#define SWIF                             BANKMASK(PIR0), 0, b
#define SWIP                             BANKMASK(IPR0), 0, b
#define SYSCMD                           BANKMASK(PMD0), 7, b
#define T016BIT                          BANKMASK(T0CON0), 4, a
#define T0ASYNC                          BANKMASK(T0CON1), 4, a
#define T0CKPS0                          BANKMASK(T0CON1), 0, a
#define T0CKPS1                          BANKMASK(T0CON1), 1, a
#define T0CKPS2                          BANKMASK(T0CON1), 2, a
#define T0CKPS3                          BANKMASK(T0CON1), 3, a
#define T0CS0                            BANKMASK(T0CON1), 5, a
#define T0CS1                            BANKMASK(T0CON1), 6, a
#define T0CS2                            BANKMASK(T0CON1), 7, a
#define T0EN                             BANKMASK(T0CON0), 7, a
#define T0MD16                           BANKMASK(T0CON0), 4, a
#define T0OUT                            BANKMASK(T0CON0), 5, a
#define T0PR0                            BANKMASK(TMR0H), 0, a
#define T0PR1                            BANKMASK(TMR0H), 1, a
#define T0PR2                            BANKMASK(TMR0H), 2, a
#define T0PR3                            BANKMASK(TMR0H), 3, a
#define T0PR4                            BANKMASK(TMR0H), 4, a
#define T0PR5                            BANKMASK(TMR0H), 5, a
#define T0PR6                            BANKMASK(TMR0H), 6, a
#define T0PR7                            BANKMASK(TMR0H), 7, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1CS0                            BANKMASK(T1CLK), 0, a
#define T1CS1                            BANKMASK(T1CLK), 1, a
#define T1CS2                            BANKMASK(T1CLK), 2, a
#define T1CS3                            BANKMASK(T1CLK), 3, a
#define T1CS4                            BANKMASK(T1CLK), 4, a
#define T1GE                             BANKMASK(T1GCON), 7, a
#define T1GGO                            BANKMASK(T1GCON), 3, a
#define T1GPOL                           BANKMASK(T1GCON), 6, a
#define T1GSPM                           BANKMASK(T1GCON), 4, a
#define T1GSS0                           BANKMASK(T1GATE), 0, a
#define T1GSS1                           BANKMASK(T1GATE), 1, a
#define T1GSS2                           BANKMASK(T1GATE), 2, a
#define T1GSS3                           BANKMASK(T1GATE), 3, a
#define T1GSS4                           BANKMASK(T1GATE), 4, a
#define T1GTM                            BANKMASK(T1GCON), 5, a
#define T1GVAL                           BANKMASK(T1GCON), 2, a
#define T1RD16                           BANKMASK(T1CON), 1, a
#define T2CKPOL                          BANKMASK(T2HLT), 6, a
#define T2CKPS0                          BANKMASK(T2CON), 4, a
#define T2CKPS1                          BANKMASK(T2CON), 5, a
#define T2CKPS2                          BANKMASK(T2CON), 6, a
#define T2CKSYNC                         BANKMASK(T2HLT), 5, a
#define T2CS0                            BANKMASK(T2CLKCON), 0, a
#define T2CS1                            BANKMASK(T2CLKCON), 1, a
#define T2CS2                            BANKMASK(T2CLKCON), 2, a
#define T2CS3                            BANKMASK(T2CLKCON), 3, a
#define T2MODE0                          BANKMASK(T2HLT), 0, a
#define T2MODE1                          BANKMASK(T2HLT), 1, a
#define T2MODE2                          BANKMASK(T2HLT), 2, a
#define T2MODE3                          BANKMASK(T2HLT), 3, a
#define T2MODE4                          BANKMASK(T2HLT), 4, a
#define T2ON                             BANKMASK(T2CON), 7, a
#define T2OUTPS0                         BANKMASK(T2CON), 0, a
#define T2OUTPS1                         BANKMASK(T2CON), 1, a
#define T2OUTPS2                         BANKMASK(T2CON), 2, a
#define T2OUTPS3                         BANKMASK(T2CON), 3, a
#define T2PSYNC                          BANKMASK(T2HLT), 7, a
#define T2RSEL0                          BANKMASK(T2RST), 0, a
#define T2RSEL1                          BANKMASK(T2RST), 1, a
#define T2RSEL2                          BANKMASK(T2RST), 2, a
#define T2RSEL3                          BANKMASK(T2RST), 3, a
#define T2RSEL4                          BANKMASK(T2RST), 4, a
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CS0                            BANKMASK(T3CLK), 0, a
#define T3CS1                            BANKMASK(T3CLK), 1, a
#define T3CS2                            BANKMASK(T3CLK), 2, a
#define T3CS3                            BANKMASK(T3CLK), 3, a
#define T3CS4                            BANKMASK(T3CLK), 4, a
#define T3GE                             BANKMASK(T3GCON), 7, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GATE), 0, a
#define T3GSS1                           BANKMASK(T3GATE), 1, a
#define T3GSS2                           BANKMASK(T3GATE), 2, a
#define T3GSS3                           BANKMASK(T3GATE), 3, a
#define T3GSS4                           BANKMASK(T3GATE), 4, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3RD16                           BANKMASK(T3CON), 1, a
#define T4CKPOL                          BANKMASK(T4HLT), 6, a
#define T4CKPS0                          BANKMASK(T4CON), 4, a
#define T4CKPS1                          BANKMASK(T4CON), 5, a
#define T4CKPS2                          BANKMASK(T4CON), 6, a
#define T4CKSYNC                         BANKMASK(T4HLT), 5, a
#define T4CS0                            BANKMASK(T4CLKCON), 0, a
#define T4CS1                            BANKMASK(T4CLKCON), 1, a
#define T4CS2                            BANKMASK(T4CLKCON), 2, a
#define T4CS3                            BANKMASK(T4CLKCON), 3, a
#define T4MODE0                          BANKMASK(T4HLT), 0, a
#define T4MODE1                          BANKMASK(T4HLT), 1, a
#define T4MODE2                          BANKMASK(T4HLT), 2, a
#define T4MODE3                          BANKMASK(T4HLT), 3, a
#define T4MODE4                          BANKMASK(T4HLT), 4, a
#define T4ON                             BANKMASK(T4CON), 7, a
#define T4OUTPS0                         BANKMASK(T4CON), 0, a
#define T4OUTPS1                         BANKMASK(T4CON), 1, a
#define T4OUTPS2                         BANKMASK(T4CON), 2, a
#define T4OUTPS3                         BANKMASK(T4CON), 3, a
#define T4PSYNC                          BANKMASK(T4HLT), 7, a
#define T4RSEL0                          BANKMASK(T4RST), 0, a
#define T4RSEL1                          BANKMASK(T4RST), 1, a
#define T4RSEL2                          BANKMASK(T4RST), 2, a
#define T4RSEL3                          BANKMASK(T4RST), 3, a
#define T4RSEL4                          BANKMASK(T4RST), 4, a
#define T5CKPS0                          BANKMASK(T5CON), 4, a
#define T5CKPS1                          BANKMASK(T5CON), 5, a
#define T5CS0                            BANKMASK(T5CLK), 0, a
#define T5CS1                            BANKMASK(T5CLK), 1, a
#define T5CS2                            BANKMASK(T5CLK), 2, a
#define T5CS3                            BANKMASK(T5CLK), 3, a
#define T5CS4                            BANKMASK(T5CLK), 4, a
#define T5GE                             BANKMASK(T5GCON), 7, a
#define T5GGO                            BANKMASK(T5GCON), 3, a
#define T5GPOL                           BANKMASK(T5GCON), 6, a
#define T5GSPM                           BANKMASK(T5GCON), 4, a
#define T5GSS0                           BANKMASK(T5GATE), 0, a
#define T5GSS1                           BANKMASK(T5GATE), 1, a
#define T5GSS2                           BANKMASK(T5GATE), 2, a
#define T5GSS3                           BANKMASK(T5GATE), 3, a
#define T5GSS4                           BANKMASK(T5GATE), 4, a
#define T5GTM                            BANKMASK(T5GCON), 5, a
#define T5GVAL                           BANKMASK(T5GCON), 2, a
#define T5RD16                           BANKMASK(T5CON), 1, a
#define T6CKPOL                          BANKMASK(T6HLT), 6, a
#define T6CKPS0                          BANKMASK(T6CON), 4, a
#define T6CKPS1                          BANKMASK(T6CON), 5, a
#define T6CKPS2                          BANKMASK(T6CON), 6, a
#define T6CKSYNC                         BANKMASK(T6HLT), 5, a
#define T6CS0                            BANKMASK(T6CLKCON), 0, a
#define T6CS1                            BANKMASK(T6CLKCON), 1, a
#define T6CS2                            BANKMASK(T6CLKCON), 2, a
#define T6CS3                            BANKMASK(T6CLKCON), 3, a
#define T6MODE0                          BANKMASK(T6HLT), 0, a
#define T6MODE1                          BANKMASK(T6HLT), 1, a
#define T6MODE2                          BANKMASK(T6HLT), 2, a
#define T6MODE3                          BANKMASK(T6HLT), 3, a
#define T6MODE4                          BANKMASK(T6HLT), 4, a
#define T6ON                             BANKMASK(T6CON), 7, a
#define T6OUTPS0                         BANKMASK(T6CON), 0, a
#define T6OUTPS1                         BANKMASK(T6CON), 1, a
#define T6OUTPS2                         BANKMASK(T6CON), 2, a
#define T6OUTPS3                         BANKMASK(T6CON), 3, a
#define T6PSYNC                          BANKMASK(T6HLT), 7, a
#define T6RSEL0                          BANKMASK(T6RST), 0, a
#define T6RSEL1                          BANKMASK(T6RST), 1, a
#define T6RSEL2                          BANKMASK(T6RST), 2, a
#define T6RSEL3                          BANKMASK(T6RST), 3, a
#define T6RSEL4                          BANKMASK(T6RST), 4, a
#define TCZIE                            BANKMASK(SPI1INTE), 6, b
#define TCZIF                            BANKMASK(SPI1INTF), 6, b
#define TMD0                             BANKMASK(ADCON3), 0, b
#define TMD1                             BANKMASK(ADCON3), 1, b
#define TMD2                             BANKMASK(ADCON3), 2, b
#define TMR0                             BANKMASK(SMT1TMRL), 0, b
#define TMR0H0                           BANKMASK(TMR0H), 0, a
#define TMR0H1                           BANKMASK(TMR0H), 1, a
